/**
 ****************************************************************************************************
 * @file        iwdg.h
 * @version     V1.0
 * @brief       独立看门狗 驱动代码
 ****************************************************************************************************
 * @attention   Waiken-Smart 慧勤智远
 *
 * 实验平台:    STM32H723ZGT6小系统板
 *
 ****************************************************************************************************
 */

#ifndef __IWDG_H
#define __IWDG_H

#ifdef __cplusplus__
extern "C" {
#endif
#include "sys/sys.h"


/******************************************************************************************/

void iwdg_init(uint32_t prer, uint16_t rlr);        /* 初始化独立看门狗 */
void iwdg_feed(void);                               /* 喂独立看门狗 */

#ifdef __cplusplus__
{
#endif

#endif








